app/controllers/beers_controller.rb

  def index
    @beers = Beer.all
---
SELECT * FROM "beers"

  def show
    @beer = Beer.find(params[:id])
---
SELECT * FROM "beers" WHERE ("beers"."id" = 1)

  def edit
    @beer = Beer.find(params[:id])
---
SELECT * FROM "beers" WHERE ("beers"."id" = 1)

  def create
    @beer = Beer.new(params[:beer])

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("city", "created_at", "updated_at", "brewer", "beer_name", "state") VALUES('Healdsburg', '2010-07-14 01:29:26', '2010-07-14 01:29:26', 'Bear Republic', 'Red Rocket Ale', 'CA')

  def update
    @beer = Beer.find(params[:id])

    respond_to do |format|
      if @beer.update_attributes(params[:beer])
---
SELECT * FROM "beers" WHERE ("beers"."id" = 1)
UPDATE "beers" SET "updated_at" = '2010-07-14 16:06:13', "brewer" = 'Bear Republic ' WHERE "id" = 1

  def destroy
    @beer = Beer.find(params[:id])
    @beer.destroy
---
SELECT * FROM "beers" WHERE ("beers"."id" = 1)
DELETE FROM "beers" WHERE "id" = 1